Autodesk.Revit.DB.BaseImportOptions.SetLayerSelection(System.Collections.Generic.ICollection{System.String})
Set the layers name which user want to import into Revit.
Remarks:
If user don't set any layer selection, all layers would be imported into Revit for dgn.
But for dwg|dxf, all layers (or visible layers, it is up to visibleLayersOnly was set or not) would be imported into Revit.
layerSelection:
The layers imported into Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.SetDefaultLengthUnit(Autodesk.Revit.DB.ForgeTypeId)
Set the default length unit used for importing unitless files.
specTypeId:
The default length unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given specTypeId is not a supported unit of length.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022.1

Autodesk.Revit.DB.BaseImportOptions.GetDefaultLengthUnit
Get the default length unit used for importing unitless files.
Since:
2022.1

Autodesk.Revit.DB.BaseImportOptions.ReferencePoint
The 3D point in the document where the imported instance will be inserted.
If not explicitly set, the instance will be inserted at the document origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.CustomScale
Scaling the import.
If this is defined and a valid value (> 0.0), it takes priority over units.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.Unit
The unit of measure for imported geometry.
Remarks:
Units are used to calculate the import scale unless scale is defined explicitly using CustomScale, in which case Units will be ignored.
Feet, inches, meters, centimeters, decimeters, millimeters are all supported. If Default unit is set, Revit will read and use the units
from the file. If units are not available or accessible there, Revit will default to %overrideUnit%.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013